src/DataProcessors/ГрафикРаботыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ГрафикРаботыСотрудников</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Catalogs/ПериодыРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПериодыРаботы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ГрафикРаботыСотрудников/Forms/МастерЗаполнения/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктурнаяЕдиница") Тогда 
		Объект.СтруктурнаяЕдиница = Параметры.СтруктурнаяЕдиница;
	КонецЕсли;
	
	Если  Параметры.Свойство("МассивИндексовСотрудников") Тогда 
		Индекс = 0;
		Для Каждого Идентификатор Из Параметры.МассивИндексовСотрудников Цикл
			СтрокаТЧ = ТаблицаСотрудники.Добавить();
			СтрокаТЧ.Идентификатор = Идентификатор;
			СтрокаТЧ.Сотрудник = Параметры.МассивСотрудников[Индекс];
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЕсли;
	
	Если Параметры.Свойство("Период") Тогда 
		Если ЗначениеЗаполнено(Параметры.Период) Тогда
			ДатаНачала = ?(НачалоМесяца(Параметры.Период) < ТекущаяДата(), ТекущаяДата(), НачалоМесяца(Параметры.Период)) ;
			ДатаОкончания = КонецМесяца(Параметры.Период);
		КонецЕсли;
		Объект.Период = Параметры.Период;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПериодыРаботы.НачалоСмены КАК НачалоСмены,
	|	ПериодыРаботы.ОкончаниеСмены КАК ОкончаниеСмены,
	|	ПериодыРаботы.Ссылка КАК Наименование,
	|	0 КАК ИндексКартинки
	|ИЗ
	|	Справочник.ПериодыРаботы КАК ПериодыРаботы
	|ГДЕ
	|	(НЕ ПериодыРаботы.ПометкаУдаления)
	|	И ПериодыРаботы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачалоСмены,
	|	ОкончаниеСмены УБЫВ";
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	
	ПериодыРаботы.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Элементы.ДобавитьПериод.Доступность = (ПериодыРаботы.Количество() > 0);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" объект поле "ТипПериода"
//
Процедура ТипПериодаПриИзменении(Элемент)
	ИнициализироватьСписокУстановленныхПериодов();
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Выбор" объект поле "УстановленныеПериоды"
//
Процедура УстановленныеПериодыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ИндексСтроки = Элементы.УстановленныеПериоды.ТекущиеДанные.НомерСтроки - 1;
	УстановленныеПериодыВыборНаСервере(ИндексСтроки);
КонецПроцедуры

&НаСервере
// Процедура - обработчик события "ВыборНаСервере" объект поле "УстановленныеПериоды"
//
Процедура УстановленныеПериодыВыборНаСервере(ИндексСтроки)
	
	Если Элементы.ПериодыРаботы.ВыделенныеСтроки.Количество() > 0 Тогда 
		
		УстановленныеПериоды[ИндексСтроки].СписокПериодов.Очистить();
		
		// Период = "";
		// Первый = Истина;
		// ОкончаниеСмены  = ПериодыРаботы[0].ОкончаниеСмены;
		//
		//// Создаем ТЗ для сортировки массива выделенных строк
		// КоличествоВыделенных = Элементы.ПериодыРаботы.ВыделенныеСтроки.Количество();
		// ТаблицаВыделенныхСтрок = Новый ТаблицаЗначений();
		// ТаблицаВыделенныхСтрок.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
		//
		// Для Индекс = 1 По КоличествоВыделенных Цикл
		//	ТаблицаВыделенныхСтрок.Добавить();	
		// КонецЦикла;
		//
		// ТаблицаВыделенныхСтрок.ЗагрузитьКолонку(Элементы.ПериодыРаботы.ВыделенныеСтроки, 0);
		// ТаблицаВыделенныхСтрок.Сортировать("НомерСтроки");
		// МассивНомеровСтрок = ТаблицаВыделенныхСтрок.ВыгрузитьКолонку(0);
		//
		//// Заполняем таблицу периодов для выделенной строки
		// Для Каждого ЭлементМассива Из МассивНомеровСтрок Цикл
		//	
		//	СтрокаТЧ = ПериодыРаботы[ЭлементМассива];
		//	
		//	Если Первый Или СтрокаТЧ.НачалоСмены >= ОкончаниеСмены Тогда 
		//		ОкончаниеСмены = СтрокаТЧ.ОкончаниеСмены;
		//		Первый = Ложь;
		//		Период = Период + СтрокаТЧ.Наименование + ";" + Символы.ПС;
		//		ПериодСтруктура = Новый Структура("НачалоСмены, ОкончаниеСмены", СтрокаТЧ.НачалоСмены, СтрокаТЧ.ОкончаниеСмены);
		//		УстановленныеПериоды[ИндексСтроки].СписокПериодов.Добавить(ПериодСтруктура,  Формат(ПериодСтруктура.НачалоСмены, "ДФ='ЧЧ:мм'") + " - " + Формат(ПериодСтруктура.ОкончаниеСмены, "ДФ='ЧЧ:мм'" + Символы.ПС));
		
		//	КонецЕсли;
		//	
		// КонецЦикла;
		//
		// УстановленныеПериоды[ИндексСтроки].ВыбранныйПериод = Период; 
		
		ТаблицаВыделенныхСтрок = Новый ТаблицаЗначений();
		ТаблицаВыделенныхСтрок.Колонки.Добавить("НачалоСмены");
		ТаблицаВыделенныхСтрок.Колонки.Добавить("ОкончаниеСмены");
		Для Каждого ЭлементМассива из Элементы.ПериодыРаботы.ВыделенныеСтроки Цикл
			НоваяСтрока = ТаблицаВыделенныхСтрок.Добавить();
			СтрокаТЧ = ПериодыРаботы[ЭлементМассива];
			НоваяСтрока.НачалоСмены = СтрокаТЧ.НачалоСмены;
			НоваяСтрока.ОкончаниеСмены = СтрокаТЧ.ОкончаниеСмены;
		КонецЦикла;
		
		ТаблицаВыделенныхСтрок.Сортировать("НачалоСмены Возр");
		Счетчик = 0;
		Пока Счетчик < ТаблицаВыделенныхСтрок.Количество()-1 Цикл
			Если ТаблицаВыделенныхСтрок[Счетчик].ОкончаниеСмены >= ТаблицаВыделенныхСтрок[Счетчик + 1].НачалоСмены Тогда
				Если ТаблицаВыделенныхСтрок[Счетчик].ОкончаниеСмены >= ТаблицаВыделенныхСтрок[Счетчик + 1].ОкончаниеСмены Тогда				
					ТаблицаВыделенныхСтрок.Удалить(Счетчик + 1);                                                  
				Иначе
					ТаблицаВыделенныхСтрок[Счетчик].ОкончаниеСмены = ТаблицаВыделенныхСтрок[Счетчик + 1].ОкончаниеСмены;
					ТаблицаВыделенныхСтрок.Удалить(Счетчик + 1);
				КонецЕсли;
			Иначе
				Счетчик = Счетчик + 1;
			КонецЕсли;
		КонецЦикла;			
		Период = "";		
		Для Каждого СтрокаТЧ из ТаблицаВыделенныхСтрок Цикл
			Период = Период + Формат(СтрокаТЧ.НачалоСмены, "ДФ=ЧЧ:мм; ДП=00:00") + " - " + Формат(СтрокаТЧ.ОкончаниеСмены, "ДФ='ЧЧ:мм'") + ";" + Символы.ПС;
			ПериодСтруктура = Новый Структура("НачалоСмены, ОкончаниеСмены", СтрокаТЧ.НачалоСмены, СтрокаТЧ.ОкончаниеСмены);
			УстановленныеПериоды[ИндексСтроки].СписокПериодов.Добавить(ПериодСтруктура,  Формат(ПериодСтруктура.НачалоСмены, "ДФ=ЧЧ:мм; ДП=00:00") + " - " + Формат(ПериодСтруктура.ОкончаниеСмены, "ДФ='ЧЧ:мм'" + Символы.ПС));
		КонецЦикла;
		
		УстановленныеПериоды[ИндексСтроки].ВыбранныйПериод = Период; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" полей формы "ДатаНачала" и "ДатаОкончания"
//
Процедура ПериодПриИзменении(Элемент)
	
	Если Элемент.Имя = "ДатаНачала" Тогда
		
		Если НачалоМесяца(ДатаНачала) <> Объект.Период Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата начала периода должна быть в пределах установленного в графике месяца");
			ДатаНачала = ТекущаяДата();
		КонецЕсли;
		
		Если ДатаНачала < ТекущаяДата() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата начала периода не должна быть меньше текущей даты");
			ДатаНачала = ТекущаяДата();
		КонецЕсли;
		
		Если ДатаНачала > ДатаОкончания Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата начала периода не должна превышать дату окончания периода");
			ДатаНачала = ТекущаяДата();
		КонецЕсли;
		
	ИначеЕсли Элемент.Имя = "ДатаОкончания" Тогда			
		
		Если КонецМесяца(ДатаОкончания) <> КонецМесяца(Объект.Период) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата окончания периода должна быть в пределах установленного в графике месяца");
			ДатаОкончания = КонецМесяца(Объект.Период);
		КонецЕсли;
		
		Если ДатаНачала > ДатаОкончания Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата окончания периода должна быть больше даты начала периода");
			ДатаОкончания = КонецМесяца(Объект.Период);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

 #КонецОбласти

 #Область ОбработчикиКомандФормы

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
// Процедура обработчик команды "ДобавитьПериодРаботыИзСправочника".
//
Процедура ДобавитьПериодРаботыИзСправочника(Команда)   
	
	ОткрытьФорму("Справочник.ПериодыРаботы.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ПослеДобавленияПериодаРаботы", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды "ДобавитьПериодРаботыИзСправочника".
//
Процедура УдалитьПериодРаботыИзСправочника(Команда)
	Если Элементы.ПериодыРаботы.ТекущиеДанные <> Неопределено Тогда
		Элементы.ПериодыРаботы.Обновить();
		ПериодыРаботы.Удалить(Элементы.ПериодыРаботы.ТекущиеДанные.НомерСтроки);
		Элементы.УдалитьПериодРаботыИзСправочника.Доступность = (ПериодыРаботы.Количество() > 0);
		Для Каждого СтрокаТЧ Из ПериодыРаботы Цикл
			СтрокаТЧ.НомерСтроки = ПериодыРаботы.Индекс(СтрокаТЧ);	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды "ДобавитьПериодРаботыИзСправочника".
//
Процедура ДобавитьПериод(Команда)
	
	СтрокаТЧ 								= УстановленныеПериоды.Добавить();
	СтрокаТЧ.НомерСтроки 					= УстановленныеПериоды.Количество();
	Элементы.УстановитьПериоды.Доступность 	= (УстановленныеПериоды.Количество() > 0 И ПериодыРаботы.Количество() > 0);
	Элементы.УдалитьПериод.Доступность		= (УстановленныеПериоды.Количество() > 0);
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды "УдалитьПериод".
//
Процедура УдалитьПериод(Команда)
	
	Если Элементы.УстановленныеПериоды.ТекущиеДанные <> Неопределено Тогда
		Элементы.ПериодыРаботы.Обновить();
		УстановленныеПериоды.Удалить(Элементы.УстановленныеПериоды.ТекущиеДанные.НомерСтроки - 1);
		Элементы.УдалитьПериод.Доступность = (УстановленныеПериоды.Количество() > 0);
		Для Каждого СтрокаТЧ Из УстановленныеПериоды Цикл
			СтрокаТЧ.НомерСтроки = УстановленныеПериоды.Индекс(СтрокаТЧ) + 1;	
		КонецЦикла;
	КонецЕсли;
	Элементы.УстановитьПериоды.Доступность 	= (УстановленныеПериоды.Количество() > 0 И ПериодыРаботы.Количество() > 0);
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик команды "УстановитьПериоды".
//
Процедура УстановитьПериоды(Команда)
	
	АдресВременногоХранилища = УстановитьПериодыНаСервере();
	ОповеститьОВыборе(АдресВременногоХранилища);
	
КонецПроцедуры

&НаСервере
// Процедура обработчик команды "УстановитьПериодыНаСервере".
//
Функция УстановитьПериодыНаСервере()
	
	Если Не ЗначениеЗаполнено(ДатаНачала) И Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены значения периодов!");
		Возврат Неопределено;
	КонецЕсли;
	
	ГрафикРаботы = Новый ТаблицаЗначений;
	ГрафикРаботы.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Число"));
	ГрафикРаботы.Колонки.Добавить("МассивСообщений", Новый ОписаниеТипов("Массив"));
	ГрафикРаботы.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ГрафикРаботы.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	МассивСообщений = Новый Массив;
	Для Инд = 1 По 31 Цикл
		ГрафикРаботы.Колонки.Добавить("День"+Инд, Новый ОписаниеТипов("СписокЗначений"));	
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ТаблицаСотрудники Цикл
		
		ГраничноеЗначение = ((ДатаОкончания) - (ДатаНачала))/60/60/24;
		ДатаНачалаСмены = ДатаНачала;
		МассивСообщений = Новый Массив;
		
		СтрокаГР = ГрафикРаботы.Добавить();
		СтрокаГР.Идентификатор = СтрокаТаблицы.Идентификатор;
		СтрокаГР.ДатаНачала = ДатаНачала;
		СтрокаГР.ДатаОкончания = ДатаОкончания;
		
		КоличествоСтрок = УстановленныеПериоды.Количество() - 1;		
			
		Пока ДатаНачалаСмены <= ДатаОкончания Цикл
			
			Для Каждого СтрокаТЧ Из УстановленныеПериоды Цикл
				
				
				Если  ДатаНачалаСмены > КонецМесяца(Объект.Период) Тогда 
					Прервать;	
				КонецЕсли;
					
				Если ТипПериодаЗаполнения Тогда
					СтрокаТЧ = УстановленныеПериоды[ДеньНедели(ДатаНачалаСмены) - 1]
				КонецЕсли;
				
					
				ЕстьЗаписи = ОбщегоНазначенияСтоматология.ПроверитьНаличиеПредварительнойЗаписи(СтрокаТаблицы.Сотрудник, ДатаНачалаСмены, СтрокаТЧ.СписокПериодов.ВыгрузитьЗначения(), Объект.СтруктурнаяЕдиница); 
				
				ЕстьЗанятость = ОбщегоНазначенияСтоматология.ПроверитьЗанятостьСотрудника(СтрокаТЧ.СписокПериодов.ВыгрузитьЗначения(), СтрокаТаблицы.Сотрудник, объект.СтруктурнаяЕдиница, ДатаНачалаСмены);
				
				Если ОбщегоНазначенияСтоматология.ПроверитьДатуУвольнения(СтрокаТаблицы.Сотрудник, ДатаНачалаСмены, Объект.СтруктурнаяЕдиница) Тогда
					ДатаНачалаСмены = КонецДня(ДатаНачалаСмены) + 1;
					Продолжить;
				КонецЕсли;
				
				Если ЕстьЗаписи Тогда
					МассивСообщений.Добавить("Для сотрудника "+СтрокаТаблицы.Сотрудник+" имеются предварительные записи на "+Формат(ДатаНачалаСмены, "ДЛФ=ДД")+", не соответствующие устанавливаемому периоду");
				ИначеЕсли ЕстьЗанятость Тогда
					МассивСообщений.Добавить("Сотрудник "+СтрокаТаблицы.Сотрудник+" уже работает в период "+Формат(ДатаНачалаСмены, "ДЛФ=ДД")+" в другой структурной единице!");
				Иначе
					СтрокаГР["День"+ День(ДатаНачалаСмены)] = СтрокаТЧ.СписокПериодов;	
				КонецЕсли;
				
				
				ДатаНачалаСмены = КонецДня(ДатаНачалаСмены) + 1;
				
				
			КонецЦикла;
			
			СтрокаГР.МассивСообщений = МассивСообщений;
		КонецЦикла;
	КонецЦикла;
	Возврат ПоместитьВоВременноеХранилище(ГрафикРаботы, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

///////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ

// Процедура - производит инициализацию элемнтов на форме
//
&НаКлиенте
Процедура ИнициализироватьСписокУстановленныхПериодов()
	
	УстановленныеПериоды.Очистить();
	
	// Если выбран тип заполнения "По дням" заполняем таблицу днями недели
	Если ТипПериодаЗаполнения Тогда
		Элементы.УстановитьПериоды.Доступность = Истина;
		Элементы.УдалитьПериод.Доступность = Ложь;
		Элементы.ДобавитьПериод.Доступность = Ложь;
		Для Индекс = 1 По 7 Цикл
			СтрокаТЧ = УстановленныеПериоды.Добавить(); 
			СтрокаТЧ.НомерСтроки = Индекс;
			СтрокаТЧ.ДеньНедели = ТРег(Формат(Дата("1000010" + Индекс),"ДФ = дддд")); 
		КонецЦикла;
	Иначе
		Элементы.УдалитьПериод.Доступность = Истина;
		Элементы.ДобавитьПериод.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - производит заполнение строки табличной части "СтановленныеПериода"
//
Процедура ЗаполнитьСтрокуТЧ(СтрокаТЧ, СсылкаНаЭлемент)
	ЗаполнитьЗначенияСвойств(СтрокаТЧ, СсылкаНаЭлемент);
	СтрокаТЧ.КартинкаСтрок 	= БиблиотекаКартинок.Картинка_Реквизит;
КонецПроцедуры

&НаКлиенте
// Процедура обработчик события "ПослеДобавленияПериодаРаботы"
//
Процедура ПослеДобавленияПериодаРаботы(Результат, ДопПараметры) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда
		СтрокаТЧ 				= ПериодыРаботы.Добавить();
		ЗаполнитьСтрокуТЧ(СтрокаТЧ, Результат);
		Элементы.УдалитьПериодРаботыИзСправочника.Доступность = (ПериодыРаботы.Количество() > 0);
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти
